In [1]:
import pandas as pd
import numpy as np

# Daten für die Übungsaufgaben
daten = {
    'Name': ['Anna', 'Mark', 'Julia', 'Tom', 'Laura', 'Peter', 'Sofia'],
    'Abteilung': ['IT', 'Sales', 'IT', 'HR', 'Sales', 'IT', 'HR'],
    'Gehalt': [70000, 62000, 75000, 50000, 68000, np.nan, 52000],
    'Eintrittsdatum': ['2020-03-15', '2019-07-01', '2021-11-01', '2022-01-10', '2018-05-20', '2020-03-15', '2023-09-01'],
    'HomeOfficeTage': [3, 2, 4, 1, 3, 3, 2]
}
# Mitarbeiter-IDs als Index
index_ids = ['M-101', 'M-102', 'M-103', 'M-104', 'M-105', 'M-106', 'M-107']

df_mitarbeiter = pd.DataFrame(daten, index=index_ids)

# Die Spalte 'Eintrittsdatum' in ein echtes Datumsformat umwandeln
df_mitarbeiter['Eintrittsdatum'] = pd.to_datetime(df_mitarbeiter['Eintrittsdatum'])

print("Mitarbeiter-DataFrame für die Übungen:")
print(df_mitarbeiter)

Mitarbeiter-DataFrame für die Übungen:
        Name Abteilung   Gehalt Eintrittsdatum  HomeOfficeTage
M-101   Anna        IT  70000.0     2020-03-15               3
M-102   Mark     Sales  62000.0     2019-07-01               2
M-103  Julia        IT  75000.0     2021-11-01               4
M-104    Tom        HR  50000.0     2022-01-10               1
M-105  Laura     Sales  68000.0     2018-05-20               3
M-106  Peter        IT      NaN     2020-03-15               3
M-107  Sofia        HR  52000.0     2023-09-01               2

## Teil 1: Daten Inspizieren (inspect_data.ipynb)
**Aufgabe 3.1**: Erster und letzter Blick

Zeige die ersten 4 Zeilen des df_mitarbeiter DataFrames an.
Zeige die letzten 2 Zeilen des df_mitarbeiter DataFrames an.

In [3]:
print(df_mitarbeiter.head(4))
print(df_mitarbeiter.tail(2))

        Name Abteilung   Gehalt Eintrittsdatum  HomeOfficeTage
M-101   Anna        IT  70000.0     2020-03-15               3
M-102   Mark     Sales  62000.0     2019-07-01               2
M-103  Julia        IT  75000.0     2021-11-01               4
M-104    Tom        HR  50000.0     2022-01-10               1
        Name Abteilung   Gehalt Eintrittsdatum  HomeOfficeTage
M-106  Peter        IT      NaN     2020-03-15               3
M-107  Sofia        HR  52000.0     2023-09-01               2

___
Aufgabe 3.2: Technische Zusammenfassung

Gib eine technische Übersicht über den DataFrame mit .info().
Frage: In welcher Spalte gibt es einen fehlenden Wert?

In [4]:
df_mitarbeiter.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, M-101 to M-107
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            7 non-null      object
 1   Abteilung       7 non-null      object
 2   Gehalt          6 non-null      float64
 3   Eintrittsdatum  7 non-null      datetime64[ns]
 4   HomeOfficeTage  7 non-null      int64
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 636.0+ bytes

___
Aufgabe 3.3: Statistische Zusammenfassung

Erstelle eine statistische Zusammenfassung für die numerischen Spalten mit .describe().
Frage: Was ist das maximale Gehalt im Datensatz?

In [5]:
df_mitarbeiter.describe()

             Gehalt                 Eintrittsdatum  HomeOfficeTage
count      6.000000                              7        7.000000
mean   62833.333333  2020-10-30 03:25:42.857142784        2.571429
min    50000.000000            2018-05-20 00:00:00        1.000000
25%    54500.000000            2019-11-07 00:00:00        2.000000
50%    65000.000000            2020-03-15 00:00:00        3.000000
75%    69500.000000            2021-12-06 00:00:00        3.000000
max    75000.000000            2023-09-01 00:00:00        4.000000
std    10087.946603                            NaN        0.975900

___
Aufgabe 3.4: Form und Spalten

Ermittle die Dimensionen (Anzahl Zeilen und Spalten) des DataFrames.
Lass dir eine Liste aller Spaltennamen ausgeben.

In [9]:
print(df_mitarbeiter.shape)

print(df_mitarbeiter.columns)

(7, 5)
Index(['Name', 'Abteilung', 'Gehalt', 'Eintrittsdatum', 'HomeOfficeTage'], dtype='object')

___
## Teil 2: Daten Auswählen (select_data.ipynb)

Aufgabe 3.5: Spalten auswählen
Wähle die Spalten Name und Gehalt aus und zeige das Ergebnis an.

In [10]:
df_mitarbeiter_neu = df_mitarbeiter[['Name', 'Gehalt']]
df_mitarbeiter_neu

        Name   Gehalt
M-101   Anna  70000.0
M-102   Mark  62000.0
M-103  Julia  75000.0
M-104    Tom  50000.0
M-105  Laura  68000.0
M-106  Peter      NaN
M-107  Sofia  52000.0


___
Aufgabe 3.6: Zeile über Index-Label auswählen
Wähle alle Informationen zum Mitarbeiter mit der ID 'M-103' (Julia) mithilfe des .loc-Accessors aus.

In [15]:
df_mitarbeiter.loc['M-103']

Name                            Julia
Abteilung                          IT
Gehalt                        75000.0
Eintrittsdatum    2021-11-01 00:00:00
HomeOfficeTage                      4
Name: M-103, dtype: object


___
Aufgabe 3.7: Einen einzelnen Wert auswählen
Greife mit .loc gezielt auf das Eintrittsdatum von Mitarbeiter 'M-105' (Laura) zu.

In [21]:
df_mitarbeiter.loc['M-103']['Eintrittsdatum']

Timestamp('2021-11-01 00:00:00')


___
Aufgabe 3.8: Zeile über Position auswählen
Wähle die dritte Zeile (den dritten Mitarbeiter) des DataFrames aus, diesmal aber über die numerische Position mit dem .iloc-Accessor.

In [25]:
df_mitarbeiter.iloc[2]

Name                            Julia
Abteilung                          IT
Gehalt                        75000.0
Eintrittsdatum    2021-11-01 00:00:00
HomeOfficeTage                      4
Name: M-103, dtype: object


___
Aufgabe 3.9: Einen "Slice" auswählen
Wähle die letzten drei Zeilen und nur die ersten beiden Spalten (Name, Abteilung) mithilfe von .iloc aus.

In [31]:
df_mitarbeiter.iloc[-3:][['Name', 'Abteilung']]

        Name Abteilung
M-105  Laura     Sales
M-106  Peter        IT
M-107  Sofia        HR


## Teil 3: Konditionale Auswahl (conditional_selection.ipynb)

Aufgabe 3.10: Einfacher Filter
Erstelle einen neuen DataFrame df_sales, der nur die Mitarbeiter aus der Abteilung 'Sales' enthält.

In [36]:
df_mitarbeiter[df_mitarbeiter['Abteilung'] == 'Sales']

        Name Abteilung   Gehalt Eintrittsdatum  HomeOfficeTage
M-102   Mark     Sales  62000.0     2019-07-01               2
M-105  Laura     Sales  68000.0     2018-05-20               3


___
Aufgabe 3.11: UND-Verknüpfung
Filtere den DataFrame so, dass er nur Mitarbeiter aus der 'IT'-Abteilung anzeigt, deren Gehalt größer als 72000 ist.

In [41]:
df_mitarbeiter[(df_mitarbeiter['Abteilung'] == 'IT') & (df_mitarbeiter['Gehalt'] > 72000)]

        Name Abteilung   Gehalt Eintrittsdatum  HomeOfficeTage
M-103  Julia        IT  75000.0     2021-11-01               4


___
Aufgabe 3.12: ODER-Verknüpfung
Erstelle einen neuen DataFrame, der alle Mitarbeiter enthält, die entweder in der 'HR'-Abteilung sind oder genau 3 HomeOfficeTage haben.

In [42]:
df_mitarbeiter[(df_mitarbeiter['Abteilung'] == 'HR') | (df_mitarbeiter['HomeOfficeTage'] == 3)]

        Name Abteilung   Gehalt Eintrittsdatum  HomeOfficeTage
M-101   Anna        IT  70000.0     2020-03-15               3
M-104    Tom        HR  50000.0     2022-01-10               1
M-105  Laura     Sales  68000.0     2018-05-20               3
M-106  Peter        IT      NaN     2020-03-15               3
M-107  Sofia        HR  52000.0     2023-09-01               2

___
Aufgabe 3.13: Filtern mit .isin()
Wähle alle Mitarbeiter aus, deren Abteilung entweder 'Sales' oder 'HR' ist. Verwende dafür die .isin()-Methode.

In [46]:
abt = ['Sales', 'HR']

df_mitarbeiter[df_mitarbeiter['Abteilung'].isin(abt)]

        Name Abteilung   Gehalt Eintrittsdatum  HomeOfficeTage
M-102   Mark     Sales  62000.0     2019-07-01               2
M-104    Tom        HR  50000.0     2022-01-10               1
M-105  Laura     Sales  68000.0     2018-05-20               3
M-107  Sofia        HR  52000.0     2023-09-01               2